package com.yht;

import org.junit.Test;
import org.springframework.boot.test.context.SpringBootTest;
import com.tencentcloudapi.common.Credential;
import com.tencentcloudapi.common.profile.ClientProfile;
import com.tencentcloudapi.common.profile.HttpProfile;
import com.tencentcloudapi.common.exception.TencentCloudSDKException;
import com.tencentcloudapi.ocr.v20181119.OcrClient;
import com.tencentcloudapi.ocr.v20181119.models.*;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

@SpringBootTest
public class InvoiceOcrWebApplicationTest {

//    @Resource
//    private OcrLogDao ocrLogDao;

    @Test
    public void main() {
//        String resultChinese = "政票据临,北京市医疗闪诊收费票据,财政部监制,540202544547 96,业,实时结算:★,医,医保已实时结算,财16139 54-02 NO.0254454796,交易流水号:051300010A180412000022,姓名,180412x5z0017,性别,医保类型:,综合门诊部,社会保障卡号:,项目/许方,单价,数量女单位,金额,城镇职工项目/规格,单价,103184070005金额,等级,西药费,13.65,阿莫西林胶囊/0.25g*204.50001/盒,4.5000,无自付氨酚伪麻美芬片I/15.片9.15001/盒,9.1500,无自付,收据联,北京市财政局印制017,盖章有效遣失不补,自付一:,4.09,门诊大额支付:,9.56 本次医保范围内金额:,13.65 起付金额:,0.00,退休补充支付:,0.00 累计医保内范围金额:,3665.35超封顶金额:,0.00,残军补助支付:,0.00度门诊大额累计支付:,1305.75 付社金额:,0.00,单位补充险[原公疗]支付,0.00本次支付后个人账户余额:,0.00自费:,0.00,合计(大写),9.56,0.00,￥:,4.09,收款单位(章):,壹拾叁元陆角伍分,收款人:,年,月13.65日,徐素珍,2018,4,12,";
//        String resultChinese = "北京市医疗网诊收,政票据监,费票据,财政部监制,54020254454795,实时结算，★,医医保已实时结算,交易流水号:051300010A180412000021,财1613954-02NO.,0254454795,姓名,20180412159882,性别:,医保类型:,综合门诊部,社会保障卡号:,项目,许方,单价,数量女单位金额,城镇职工项目/规格,单价,103184070005金额,等级,诊察费,20.00,医事服务费[一级医院/0,20.00001/次,20.0000,有自付,北京市财政局印制017,额,李刘诗,自付一，,0.00,门诊大额支付:,19.00 本次医保范围内金额:,19.00起付金额:,0.00,x英,退休补充支付:,0.00累计医保内范围金额:,3651.70超封顶金额:,1296.19 自付付金额:,0.00,残军补助支付:,0.00年度门诊大额累计支付:,1.00,单位补充险[原公疗]支付:,0.00本次支付后个人账户余额:,0.00 自费:,0.00,合计(大写),19.00,0.00,￥:,收款单位(章):,1.00,贰拾元整,收款人:,年,20.00,日,徐素珍,2018,4,12,";
//        String resultChinese = "北京市医疗陶诊收,政票据监,费票据,财政部监制,54020254454798,上传:54020254020254020254454798,业务流水号,医疗机构类型:,财1613954-02 NO.0254454798,姓名,103184070,性别,医保类型,综合门诊部,54020254020254020254454798,社会保障卡号:,项目规材,许方,单价,数量车位金额,医保,项目/规格,医保手册号:单103184070005等级,阿莫西林胶囊(0.25g*20粒),0.225-20-4.500,01,氨酚伪麻美芬片I/氨麻苯美片,0.610 -15 -9.150,01,计, ,-13.65,收据联盖章有效遗失不补,北京市财政局印制心017,上午11:37:58,20/6/2022,基金支付,个人账户支付,个人支付金额:,合计(大写,￥:,收款单位(章):肆元零角玖分,年4.09,日,收款人:,中国国际贸易中心有限公司门诊部,2018-04-12 15:12:14,XSz,";
        String resultChinese = "北京市医咛门诊收费票据,111060221,北京市,票据代总10600009,财政部监,No,0009466259,电子票据代码:,医保已实时结算,票据号96259,交款人统一社会信用代50124********2064,电子票据号码:,交款意少云,校验码:,开票日2021-11-17,项目名称,数量/单位,金额(元),备注,项目名称,数量/单位,金额(元),治疗费,62.50,备注,卫生材料费,手术赞,251.70,235.00,西药费,牙料综合治疗台(进口)//,1/人次,17.52,4.0000,无自付,光固复合树脂:前牙、后//,1/每牙,合//,调牙骨一北部弹财,1/每牙,50.0000,无自付,2.0000,无自付,牙面光洁术-2/1,1/每牙,3.5000,周炎消炎上药//,1/每次,3、0000,无自付,无自付,根面平整术//,1/每牙,54.0000,无自付,融合牙拔除术//,1/每牙,190.0000,无自付,口腔局部缝合止血-01//,次性使用口腔器械盒1//,1/每牙,7.7000,无自什,1/套,3.5000,无自付,光固化垫底材料//,1/每牙,10.0000,无自付,米树脂-2/1,1/牙,190.000,全自付,金刚砂车针-2//,1/8,组分光团化自峻蚀粘//,0.5000,全自份,第一联收据,1/每牙,21.0000,全自付,带线缝合针(医用棉纶//,1/根,10,0000,无自付,督卡园肾上腺素/1.7m*1,/克,7.0000,无自付,头孢拉定胶震/0.25g*24粒*24,1/盒,10,5200,有自付,质印制B,金额合计(大写)伍佰陆拾陆元柒角武分,(小写),566.72,业务流水号:211117wzr1000,门诊号:350124197805302064,就诊日期:2021-11-17,医疗机构美型:口腔医院,医保类型:异地保险,医保编号:RH0491169,性别:,女,医保统筹基金支付:,0.00其他支付:,0.00个人账户支付:,566.72个人现金支付:,0.00,他人自付,355.22个人自费:,211.50,4类先自付费用,0.00超限价自付费用:,7,56,城镇职工基本医疗保险个566.72,息,医保交易流水号:051592550A211117300005,复核人,收款人:,玉志荣,收款单位(章):,";
        //发票号匹配规则
        Pattern findNo = Pattern.compile("\\D\\d{10}\\D");
        Matcher matcherNo = findNo.matcher(resultChinese);
        if(matcherNo.find()){
            System.out.println("发票号："+matcherNo.group().replaceAll(",","").replaceAll("\\.",""));
        }

        //中间段项目匹配规则
        Pattern pattern = Pattern.compile("(等级)(.*?)(自付一)");
        Matcher matcher = pattern.matcher(resultChinese);

        if(matcher.find()){
            String group = matcher.group().replaceAll("等级,", "").replaceAll("自付一", "");
            System.out.println(group);

            Pattern pattern2 = Pattern.compile(",[0-9]+(.[0-9]{1,4})");
            Matcher m = pattern2.matcher(group);

            int count = 0;
            int index = 0;
            while (m.find()) {
                count++;
                System.out.println("Match number " + count);
                System.out.println("start(): " + m.start());
                System.out.println("end(): " + m.end());
                System.out.println("名称：" + group.substring(index, m.start()));
                System.out.println("金额：" + group.substring(m.start() + 1, m.end()));
                index = m.end() + 1;
            }
        }



    }


}
